/* Details of a saved card. &apos;{card brand} ending in {last 4}&apos; e.g. &apos;VISA ending in 4242&apos; */
"%1$@ ending in %2$@" = "%1$@ li jispiċċa %2$@";

/* Bank name when bank is offline for maintenance. */
"%@ - Offline" = "%@- Offline";

/* Text for a button that, when tapped, displays another screen where the customer can add payment method details */
"+ Add" = "+ Żid";

/* Text for a button that, when tapped, displays another screen where the customer can enter card details */
"+ Add card" = "+ Żid kard";

/* Source type brand name */
"3D Secure" = "3D Secure";

/* Title for address entry section */
"ACCOUNT HOLDER ADDRESS" = "INDIRIZZ TAD-DETENTUR TAL-KONT";

/* This is a Payment Method type brand name so shouldn&apos;t be translated unless it has a different name in a given localization. */
"AU BECS Debit" = "Debitu  AU BECS";

/* Payment Method type brand name. */
"AU BECS Direct Debit" = "Debitu Dirett BECS AU";

/* part of {Account} ending in {last4} */
"Account" = "Kont";

/* Caption for Name field on bank info form */
"Account Holder Name" = "Isem id-Detentur tal-Kont";

/* Placeholder text for Account number entry field for BECS Debit. */
"Account number" = "In-numru tal-kont";

/* Button to add a new credit card. */
"Add New Card…" = "Żid Kard Ġdida…";

/* Title for Add a Card view */
"Add a Card" = "Żid Kard";

/* Title for SEPA Debit Account form */
"Add a Direct Debit Account" = "Żid Kont tad-Debitu Dirett";

/* Title shown above a card entry form */
"Add a card" = "Żid kard";

/* Text for a button that, when tapped, displays another screen where the customer can add a new payment method */
"Add a payment method" = "Żid metodu tal-pagament";

/* Button prompt to add a bank account as a payment method. */
"Add bank account" = "Żid kont tal-bank";

/* Label of a button displayed below a card entry form that saves the card details */
"Add card" = "Żid kard";

/* Text for a button that, when tapped, displays another screen where the customer can add payment method details */
"Add new payment method" = "Żid metodu tal-ħlas ġdid";

/* Title shown above a form where the customer can enter payment information like credit card details, email, billing address, etc. */
"Add your payment information" = "Żid l-informazzjoni dwar il-pagament tiegħek";

/* Address line 2 placeholder for billing address form. */
"Address line 2 (optional)" = "Indirizz linja 2 (mhux obbligatorju)";

/* Payment Method type brand name */
"Affirm" = "Affirm";

/* Payment Method type brand name  */
"Afterpay" = "Afterpay";

/* Payment Method type brand name */
"AfterpayClearpay" = "AfterpayClearpay";

/* Payment Method type brand name */
"AfterpayClearpay_copy" = "AfterpayClearpay";

/* Source type brand name */
"Alipay" = "Alipay";

/* Text for Apple Pay payment method */
"Apple Pay" = "Apple Pay";

/* Caption for Apartment/Address line 2 field on address form */
"Apt." = "Appartament";

/* Title of confirmation prompt when removing a saved card. */
"Are you sure you want to remove this card?" = "Żgur li tixtieq tneħħi dil-karta?";

/* Title of confirmation prompt when removing a linked bank account. */
"Are you sure you want to remove this linked account?" = "Żgur li tixtieq tneħħi dal-kont marbut?";

/* Title for bank picker section */
"BANK" = "BANK";

/* Title for bank account information form */
"BANK ACCOUNT INFORMATION" = "INFORMAZZJONI TAL-KONT BANKARJU";

/* Title for billing address entry section */
"BILLING ADDRESS" = "INDIRIZZ TAL-KONT";

/* Payment Method type brand name */
"BLIK" = "BLIK";

/* Placeholder text for BSB Number entry field for BECS Debit. */
"BSB" = "BSB";

/* Text for back button */
"Back" = "Lura";

/* Source type brand name */
"Bancontact" = "Bancontact";

/* Link Instant Debit payment method display name */
"Bank" = "Bank";

/* Label for Bank Account selection or detail entry form */
"Bank Account" = "Kont bankarju";

/* Title for billing address entry section */
"Billing Address" = "Indirizz tal-Kont";

/* Billing address section title for card form entry. */
"Billing address" = "Indirizz tal-kont";

/* Payment Method type brand name */
"Boleto" = "Boleto";

/* Klarna buy now or pay later copy */
"Buy now or pay later with Klarna." = "Ixtri issa jew ħallas iktar tard bil-Klarna.";

/* Text providing link to terms for ACH payments */
"By continuing, you agree to authorize payments pursuant to <terms>these terms</terms>." = "Meta tkompli tkun qed taqbel li tawtorizza l-pagamenti skont <terms>dar-regoli</terms>.";

/* Mandate text displayed when paying via Link instant debit. */
"By continuing, you agree to authorize payments pursuant to these <terms>terms</terms>." = "Meta tkompli, inti taqbel li tawtorizza l-pagamenti skont dawn <terms>it-termini</terms>.";

/* Legal text shown when creating a Link account. */
"By joining Link, you agree to the <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "Meta tingħaqad ma' Link tkun qed taqbel mat-<terms>Termini</terms> u l-<privacy>Politika tal-Privatezza</privacy>.";

/* SEPA legal authorization text – must use official translations. */
"By providing your IBAN and confirming this payment, you are authorizing %@ and Stripe, our payment service provider, to send instructions to your bank to debit your account and your bank to debit your account in accordance with those instructions. You are entitled to a refund from your bank under the terms and conditions of your agreement with your bank. A refund must be claimed within 8 weeks starting from the date on which your account was debited." = "Meta tipprovdi l-IBAN tiegħek u tikkonferma dan il-pagament, inti tawtorizza lil %@ u Stripe, il-fornitur tas-servizz tal-pagamenti tagħna, biex jibagħtu istruzzjonijiet lill-bank tiegħek biex jiddebita l-kont tiegħek u l-bank tiegħek biex jiddebita l-kont tiegħek skont dawk l-istruzzjonijiet. Inti intitolat għal rifużjoni mill-bank tiegħek skont it-termini u l-kundizzjonijiet tal-ftehim tiegħek mal-bank tiegħek. Rifużjoni trid tintalab fi żmien 8 ġimgħat li jibdew mid-data li fiha kien iddebitat il-kont tiegħek.";

/* Legal text shown when using AUBECS. */
"By providing your bank account details and confirming this payment, you agree to this Direct Debit Request and the <terms>Direct Debit Request service agreement</terms>, and authorise Stripe Payments Australia Pty Ltd ACN 160 180 343 Direct Debit User ID number 507156 (“Stripe”) to debit your account through the Bulk Electronic Clearing System (BECS) on behalf of %@ (the \"Merchant\") for any amounts separately communicated to you by the Merchant. You certify that you are either an account holder or an authorised signatory on the account listed above." = "Meta tagħti d-dettalji tal-kont tal-bank tiegħek u tikkonferma dal-pagament tkun qed taqbel mat-Talba tad-Debitu Dirett u mal-<terms>ftehim tas-servizz tat-Talba tad-Debitu Dirett</terms> u tkun qed tawtorizza lil Stripe Payments Australia Pty Ltd ACN 160 180 343 bin-numru tal-identità tal-Utent tad-Debitu Dirett 507156 (\"Stripe\") biex, f'isem %@ (\"in-Negozjant\"), tiġbor mill-kont tiegħek permezz tal-Bulk Electronic Clearing System (BECS) il-flus kollha li talbek in-Negozjant permezz ta' messaġġ ieħor. Int tagħti kelmtek li int jew sid il-kont jew firmatarju awtorizzat tal-kont muri hawn fuq.";

/* SEPA mandate text */
"By providing your payment information and confirming this payment, you authorise (A) %@ and Stripe, our payment service provider, to send instructions to your bank to debit your account and (B) your bank to debit your account in accordance with those instructions. As part of your rights, you are entitled to a refund from your bank under the terms and conditions of your agreement with your bank. A refund must be claimed within 8 weeks starting from the date on which your account was debited. Your rights are explained in a statement that you can obtain from your bank. You agree to receive notifications for future debits up to 2 days before they occur." = "Meta tagħti l-informazzjoni tal-pagament tiegħek u tikkonferma dan il-pagament, tkun qed tawtorizza lil (A) %@ u lil Stripe, l-operatur tas-servizz tal-pagamenti tagħna, biex jibagħtu struzzjonijiet lill-bank tiegħek biex jieħu l-fondi mill-kont tiegħek u (B) lill-bank tiegħek biex jieħu l-fondi mill-kont tiegħek skont dawn l-istruzzjonijiet. Bħala parti mid-drittijiet tiegħek, inti għandek dritt għall-ħlas lura mill-bank tiegħek skont it-termini u l-kundizzjonijiet tal-ftehim tiegħek mal-bank tiegħek. Ħlas lura għandu jintalab fi żmien 8 ġimgħat, li jibdew jgħoddu mid-data li fiha l-fondi jittieħdu mill-kont tiegħek. Id-drittijiet tiegħek huma spjegati f'dikjarazzjoni li tista' tikseb mingħand il-bank tiegħek. Inti taqbel li, sa jumejn qabel, tirċievi notifika kull darba li l-fondi jkunu se jittieħdu mill-kont tiegħek.";

/* Mandate text with link to terms when saving a bank account payment method to a merchant (merchant name replaces %@). */
"By saving your bank account for %@ you agree to authorize payments pursuant to <terms>these terms</terms>." = "Meta tissejvja l-kont tal-bank tiegħek għal %@ tkun qed taqbel li tawtorizza l-pagamenti skont <terms>dar-regoli</terms>.";

/* Title for card number entry field */
"CARD" = "KARD";

/* Title for contact info form */
"CONTACT" = "KUNTATT";

/* Title for country picker section */
"COUNTRY" = "PAJJIŻ";

/* Label for entering CVC in text field */
"CVC" = "CVC";

/* Label for entering CVV in text field */
"CVV" = "CVV";

/* Title for credit card number entry field */
"Card" = "Kard";

/* Details of a saved card */
"Card ending in %@" = "Il-kard li tispiċċa %@";

/* Card details entry form header title */
"Card information" = "L-informazzjoni tal-kard";

/* Label for card number entry text field */
"Card number" = "In-numru tal-kard";

/* Title for a button that allows the user to use a different email in the signup flow. */
"Change email" = "Ibdel l-indirizz tal-email";

/* TODO */
"Choose a payment method" = "Agħżel metodu tal-ħlas";

/* Payment Method type brand name */
"Clearpay" = "Clearpay";

/* Accessibility label for the button to close the card scanner. */
"Close card scanner" = "Agħlaq l-iskenner tal-kard";

/* Accessibility label describing a field for entering a login code */
"Code field" = "Taqsima tal-kodiċi";

/* Text of a notification shown to the user when a login code is successfully sent via SMS. */
"Code sent" = "Il-kodiċi ntbagħat";

/* Title for contact info form */
"Contact" = "Kuntatt";

/* Title for delivery address entry section */
"DELIVERY ADDRESS" = "INDIRIZZ TAL-KUNSINNA";

/* Label for identifying the default payment method. */
"Default" = "Standard";

/* Title for delivery info form */
"Delivery" = "Kunsinna";

/* Title for delivery address entry section */
"Delivery Address" = "Indirizz tal-Kunsinna";

/* Accessibility hint for a text field */
"Double tap to edit" = "Taptap biex tibdel";

/* Source type brand name */
"EPS" = "EPS";

/* Label title for EPS Bank */
"EPS Bank" = "EPS Bank";

/* Button title to enter editing mode */
"Edit" = "Editja";

/* Instructs the user to enter the code sent to their phone number in order to login to Link */
"Enter the code sent to %@ to use Link to pay by default." = "Daħħal il-kodiċi li bgħatna fuq %@ biex tuża Link u tħallas bil-metodu tal-pagament standard.";

/* Two factor authentication screen heading */
"Enter your verification code" = "Daħħal il-kodiċi ta' verifika tiegħek";

/* Payment Method type brand name */
"FPX" = "FPX";

/* A text notice shown when the user selects a card that requires re-entering the security code (CVV/CVC). */
"For security, please re-enter your card’s security code." = "Għal raġunijiet ta' sigurtà, jekk jogħġbok erġa' daħħal il-kodiċi tas-sigurtà tal-karta tiegħek.";

/* Label for free shipping method */
"Free" = "Bla ħlas";

/* Placeholder string for name entry field. */
"Full name" = "Isem sħiħ";

/* Source type brand name */
"Giropay" = "Giropay";

/* Payment Method type brand name. */
"GrabPay" = "GrabPay";

/* IBAN placeholder – don&apos;t translate */
"IBAN" = "IBAN";

/* Shipping form error message */
"Invalid Shipping Address" = "L-Indirizz għat-Trasport tal-Merkanzija Mhux Validu";

/* Spoken during VoiceOver when a form field has failed validation. */
"Invalid data." = "Data invalida.";

/* Title for a button that when tapped creates a Link account for the user. */
"Join Link" = "Ingħaqad ma' Link";

/* Source type brand name */
"Klarna" = "Klarna";

/* Link Payment Method type brand name */
"Link" = "Link";

/* Title for screen when data is still loading from the network. */
"Loading…" = "Qed jillowdja…";

/* label for text field to enter card expiry */
"MM / YY" = "XX / SS";

/* label for text field to enter card expiry */
"MM/YY" = "XX/SS";

/* Title for payment options section */
"MORE OPTIONS" = "AKTAR GĦAŻLIET";

/* Source type brand name */
"Multibanco" = "Multibanco";

/* Payment Method type brand name */
"NetBanking" = "NetBanking";

/* Label for button to add a new credit or debit card */
"New Card" = "Kard Ġdida";

/* Label for button to add a new SEPA Direct Debit account */
"New Direct Debit Account" = "Kont Ġdid tad-Debitu Dirett";

/* Accessibility label for button to add a new SEPA Direct Debit account */
"New SEPA Direct Debit Account" = "Kont Ġdid tad-Debitu Dirett SEPA";

/* Button to move to the next text entry field */
"Next" = "Li jmiss";

/* Text of a label for confirming an email address. E.g., 'Not user@example.com?' */
"Not %@?" = "M'intix %@?";

/* Payment Method type brand name */
"OXXO" = "OXXO";

/* Button to pay with a Bank Account (using FPX). */
"Online Banking (FPX)" = "Bankar online";

/* Separator label between two options */
"Or" = "Jew";

/* Title of a section containing multiple payment methods that can selected and will collect the payment information from the user. */
"Or pay using" = "Jew ħallas bil-";

/* Title of a section containing a card form that will collect the payment information from the user. */
"Or pay with a card" = "Jew ħallas bil-kard";

/* Source type brand name */
"P24" = "P24";

/* Label of a button that initiates payment when tapped */
"Pay %@" = "Ħallas %@";

/* Label of a button that when tapped allows the user to select a different form of payment. */
"Pay another way" = "Ħallas mod ieħor";

/* Label describing the benefit of signing up for Link. Pay faster at {Merchant Name} and thousands of merchants. e.g, 'Pay faster at Example, Inc. and thousands of merchants.' */
"Pay faster at %@ and thousands of merchants." = "Ħallas lil %@ u lil eluf ta' negozjanti oħra iktar malajr.";

/* Klarna pay later copy */
"Pay later with Klarna." = "Ħlas aktar tard bil-Klarna.";

/* Pay over time with Affirm copy */
"Pay over time with %@" = "Ħallas bin-nifs grazzi għal %@";

/* Title shown above a section containing various payment options */
"Pay using" = "Ħallas b'dal-metodu tal-pagament:";

/* Label preceding the selected payment method. */
"Pay with" = "Ħallas b':";

/* Pay with {payment method} */
"Pay with %@" = "Ħallas b' %@";

/* Payment Method type brand name */
"PayPal" = "PayPal";

/* Title for Payment Method screen */
"Payment Method" = "Metodu tal-Ħlas";

/* Accessibility instructions for card scanning. */
"Point the camera at your card." = "Dawwar il-kamera lejn il-kard tiegħek.";

/* Short string for postal code (text used in non-US countries). Please keep to 8 characters or less if possible. */
"Postal" = "Postali";

/* Caption for Postal Code field on address form (only shown in countries other than the United States) */
"Postal Code" = "Kodiċi Postali";

/* Label of a button that, when tapped, initiates payment, becomes disabled, and displays this text */
"Processing..." = "Qed jiġi pproċessat...";

/* Payment Method type brand name. */
"Przelewy24" = "Przelewy24";

/* Label title for Przelewy24 Bank */
"Przelewy24 Bank" = "Bank permezz ta' Przelewy24";

/* Button title for confirmation alert to remove a saved payment method
   Text for remove button */

"Remove" = "Neħħi";
/* Content for alert popup prompting to confirm removing a saved card. Remove {card brand} ending in {last 4} e.g. &apos;Remove VISA ending in 4242&apos; */

"Remove %1$@ ending in %2$@" = "Neħħi %1$@ li jispiċċa %2$@";
/* Content for alert popup prompting to confirm removing saved payment method. */

"Remove %@" = "Neħħi %@";
/* Title for confirmation alert to remove a card */

"Remove Card" = "Neħħi Kard";
/* Title for confirmation alert to remove a saved bank account payment method */

"Remove bank account" = "Neħħi l-kont tal-bank";
/* Content for alert popup prompting to confirm removing a saved bank account. e.g. 'Remove bank account ending in 4242' */

"Remove bank account ending in %@" = "Neħħi l-kont tal-bank li jispiċċa b'%@";
/* Title for a button that when tapped removes a saved card. */

"Remove card" = "Neħħi l-karta";
/* Title for a button that when tapped removes a linked bank account. */

"Remove linked account" = "Neħħi l-kont marbut";
/* Label for a button that re-sends the a login code when tapped */

"Resend code" = "Erġa' ibgħat il-kodiċi";
/* part of {SEPA Account} ending in {last4} */

"SEPA Account" = "Kont SEPA";
/* Payment method brand name */

"SEPA Debit" = "Debitu SEPA";
/* Source type brand name */

"SEPA Direct Debit" = "Debitu Dirett SEPA";
/* Title for shipping address entry section */

"SHIPPING ADDRESS" = "L-INDIRIZZ TAT-TRASPORT TAL-MERKANZIJA";
/* Label for shipping method form */

"SHIPPING METHOD" = "IL-MOD TAT-TRASPORT TAL-MERKANZIJA";
/* Source type brand name */

"SOFORT" = "SOFORT";
/* The label of a switch indicating whether to save the payment method for future payments. */

"Save for future payments" = "Erfa' għall-pagamenti fil-ġejjieni";
/* Label for a checkbox that when checked allows the payment information to be saved and used in future checkout sessions. */

"Save my info for secure 1-click checkout" = "Erfa' l-informazzjoni tiegħek għal ħlas sigur b'mossa waħda";
/* The label of a switch indicating whether to save the user&apos;s card for future payments to this merchant */

"Save this card for future %@ payments" = "Erfa' din il-kard għal pagamenti futuri %@";
/* The label of a switch indicating whether to save the user's card for future payment */

"Save this card for future Stripe payments" = "Erfa' din il-kard għal pagamenti futuri lil Stripe";
/* Title for the Link signup screen */

"Secure 1⁠-⁠click checkout" = "Ħlas sigur b'mossa waħda";
/* Label prompting the user to select one of the saved payment methods from a list. */

"Select a saved payment" = "Agħżel metodu tal-pagament li għandek merfugħ";
/* label for iDEAL-bank selection picker */

"Select bank" = "Agħżel bank";
/* Title shown above a carousel containing the customer&apos;s payment methods */

"Select your payment method" = "Agħżel il-metodu tal-ħlas tiegħek";
/* Label for a button or menu item that sets a payment method as default when tapped. */

"Set as default" = "Qiegħed bħala standard";
/* Label of a checkbox that when checked makes a payment method as the default one. */

"Set as default payment method" = "Qiegħed bħala l-metodu tal-pagament standard";
/* Label of a button displayed below a payment method form. Tapping the button sets the payment method up for future use */

"Set up" = "Stabilixxi";
/* Title for shipping info form */

"Shipping" = "Trasport tal-Merkanzija";
/* Title for shipping address entry section */

"Shipping Address" = "L-Indirizz tat-Trasport tal-Merkanzija";
/* Label for shipping method form */

"Shipping Method" = "Il-Mod tat-Trasport tal-Merkanzija";
/* Accessibility label for an action or a button that shows a menu. */

"Show menu" = "Uri l-menù";
/* Two factor authentication screen heading */

"Sign in to your Link account" = "Idħol fil-kont Link tiegħek";
/* Payment Method type brand name

   Source type brand name */
"Sofort" = "Sofort";

/* Caption for generalized state/province/region field on address form (not tied to a specific country&apos;s format) */
"State / Province / Region" = "Stat / Provinċja / Reġjun";

/* Prompt for microdeposit verification before completing purchase with merchant. %@ will be replaced by merchant business name */
"Stripe will deposit $0.01 to your account in 1-2 business days. Then you’ll get an email with instructions to complete payment to %@." = "Stripe se tiddepożita $0.01 fil-kont tiegħek fi żmien jum/jumejn tax-xogħol. Imbagħad se tirċievi email bl-istruzzjonijiet biex tagħmel il-pagament lil %@.";

/* Accessibility hint to tell the user that they can tap to hide additional content. */
"Tap to close" = "Agħfas biex tagħlaq";

/* Accessibility hint to tell the user that they can tap to reveal additional content. */
"Tap to expand" = "Agħfas biex tkabbar";

/* Error string displayed to user when they have entered an incomplete BSB number. BSB refers to an Australian bank account number */
"The BSB you entered is incomplete." = "Il-BSB li daħħalt mhux komplut.";

/* Error string displayed to user when they enter in an invalid BSB number. &quot;BSB&quot; refers to an Australian bank account. */
"The BSB you entered is invalid." = "Il-BSB li daħħalt mhux validu.";

/* An error message displayed when the customer's IBAN is incomplete. */
"The IBAN you entered is incomplete." = "L-IBAN li daħħalt mhux komplut.";

/* An error message displayed when the IBAN country code is not supported. */
"The IBAN you entered is invalid, \"%@\" is not a supported country code." = "L-IBAN li daħħalt mhux tajjeb, \"%@\" mhux pajjiż li jista' jintuża.";

/* Error when the seleted payment method is not available (eg attempted to use 3D Secure on a card that does not support it). */
"The selected payment method is not available." = "Il-metodu tal-ħlas magħżul mhuwiex disponibbli.";

/* A text notice shown when the user selects an expired card. */
"This card has expired. Update it to keep using it or use a different payment." = "Dil-karta skadiet. Uża metodu tal-pagament differenti jew aġġornaha jekk tixtieq tkompli tużaha.";

/* Text of a label indicating that a payment method is the default. */
"This is your default" = "Dan il-metodu tal-pagament standard tiegħek";

/* Error when 3DS2 authentication timed out. */
"Timed out authenticating your payment method -- try again" = "Skada l-ħin tal-awtentikazzjoni tal-metodu tal-ħlas tiegħek -- erġa' pprova";

/* Error when the user hasn&apos;t allowed the current app to access the camera when scanning a payment card. &apos;Settings&apos; is the localized name of the iOS Settings app. */
"To scan your card, allow camera access in Settings." = "Biex tiskennja l-kard tiegħek, ippermetti l-aċċess tal-kamera fis-Settings.";

/* Payment Method type brand name */
"UPI" = "UPI";

/* Label shown when a payment method cannot be used for the current transaction. */
"Unavailable for this purchase" = "Mhux disponibbli għal dix-xirja";

/* Default missing source type label */
"Unknown" = "Mhux magħruf";

/* Title for a button that when tapped, presents a screen for updating a card. Also the heading the screen itself. */
"Update card" = "Aġġorna l-karta";

/* Button to fill shipping address from billing address. */
"Use Billing" = "Uża tal-Kont";

/* Button to fill billing address from delivery address. */
"Use Delivery" = "Uża tal-Kunsinna";

/* Button to fill billing address from shipping address. */
"Use Shipping" = "Uża tat-Trasport tal-Merkanzija";

/* Two factor authentication screen heading */
"Use your saved info to check out faster" = "Uża l-informazzjoni li għandek merfugħa biex tħallas iktar malajr";

/* Error when 3DS2 authentication failed (e.g. customer entered the wrong code) */
"We are unable to authenticate your payment method. Please choose a different payment method and try again." = "Ma nistgħux nawtentikaw il-metodu tal-ħlas tiegħek. Jekk jogħġbok agħżel metodu tal-ħlas differenti u erġa' pprova.";

/* Source type brand name */
"WeChat Pay" = "WeChat Pay";

/* You&apos;ll be taken to {bank name} to finish your purchase. */
"You'll be taken to %@ to finish your purchase." = "Inti se tittieħed għand %@ biex tlesti x-xiri tiegħek.";

/* An error message displayed when the IBAN does not start with a two-letter country code. */
"Your IBAN should start with a two-letter country code." = "L-IBAN tiegħek għandu jibda b'kodiċi tal-pajjiż magħmul minn żewġ ittri.";

/* An error message. */
"Your IBAN should start with a two-letter country code._copy" = "L-IBAN tiegħek għandu jibda b'kodiċi tal-pajjiż magħmul minn żewġ ittri.";

/* Error message for when ZIP code in form is incomplete (US only) */
"Your ZIP is incomplete." = "Il-kodiċi postali tiegħek mhux komplut.";

/* Error message for when postal code in form is invalid (US only) */
"Your ZIP is invalid." = "Il-kodiċi postali tiegħek mhux validu.";

/* Error message for card form when card number is incomplete */
"Your card number is incomplete." = "In-numru tal-kard tiegħek mhux komplut.";

/* Error message for card form when card number is invalid */
"Your card number is invalid." = "In-numru tal-kard tiegħek mhux validu.";

/* Error message for card details form when expiration date isn&apos;t entered completely */
"Your card's expiration date is incomplete." = "Id-data tal-iskadenza tal-kard tiegħek mhijiex kompluta.";

/* Error message for card details form when expiration date is invalid */
"Your card's expiration date is invalid." = "Id-data tal-iskadenza tal-kard tiegħek mhijiex valida.";

/* String to describe an invalid month in expiry date. */
"Your card's expiration month is invalid." = "Ix-xahar tal-iskadenza tal-kard tiegħek mhux validu.";

/* String to describe an invalid year in expiry date. */
"Your card's expiration year is invalid." = "Is-sena tal-iskadenza tal-kard tiegħek mhijiex valida.";

/* Error message for card entry form when CVC/CVV is incomplete. */
"Your card's security code is incomplete." = "Il-kodiċi tas-sigurtà tal-kard tiegħek mhux komplut.";

/* Error message for card entry form when CVC/CVV is invalid */
"Your card's security code is invalid." = "Il-kodiċi tas-sigurtà tal-kard tiegħek mhux validu.";

/* Error message for when postal code in form is incomplete */
"Your postal code is incomplete." = "Il-kodiċi postali tiegħek mhux komplut.";

/* Error message for when postal code in form is invalid */
"Your postal code is invalid." = "Il-kodiċi postali tiegħek mhux validu.";

/* Caption for Zip Code field on address form (only shown when country is United States only) */
"ZIP Code" = "Kodiċi Postali";

/* accessibility label for text field */
"card number" = "in-numru tal-kard";

/* Placeholder string for email entry field. */
"example@example.com" = "eżempju@eżempju.com";

/* accessibility label for text field */
"expiration date" = "id-data tal-iskadenza";

/* Payment Method type brand name. */
"giropay" = "Giropay";

/* Source type brand name */
"iDEAL" = "iDEAL";

/* iDEAL bank section title for iDEAL form entry. */
"iDEAL Bank" = "Il-Bank iDEAL";

